# 10 Minutes to Pandas

In [2]:
import numpy as np
import pandas as pd

## Object Creation
make a series

In [2]:
s = pd.Series([1,3,5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

make a Data Frame

In [18]:
dates = pd.date_range('2013-01-01', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.444505  0.238044  0.404338 -1.341254
2013-01-02  1.074517 -0.251183  1.510523 -0.104678
2013-01-03  0.105555 -1.134463  1.265863  2.323550
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105
2013-01-05  0.161763 -0.585950  0.029123 -1.434855
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315

make a DataFrame with a dictionary

In [14]:
df2 = pd.DataFrame(
    {
        "A": (1, 2, 3, 4), #works with [] or ()
        "B": pd.Timestamp("2013-01-02"),
        "C": pd.Series(3, index=list(range(4)), dtype='float32'), #list of 4 3's
        "D": np.array([2]*4, dtype = 'int32'),
        "E": pd.Categorical(['test', 'train','test','trains']),
        "F": 'foo',
    }
)
df2

   A          B    C  D       E    F
0  1 2013-01-02  3.0  2    test  foo
1  2 2013-01-02  3.0  2   train  foo
2  3 2013-01-02  3.0  2    test  foo
3  4 2013-01-02  3.0  2  trains  foo

In [15]:
df2.dtypes  #colums have different dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df2.E

0      test
1     train
2      test
3    trains
Name: E, dtype: category
Categories (3, object): ['test', 'train', 'trains']

##Viewing data

In [21]:
df.head(2)

                   A         B         C         D
2013-01-01 -0.444505  0.238044  0.404338 -1.341254
2013-01-02  1.074517 -0.251183  1.510523 -0.104678

In [22]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105
2013-01-05  0.161763 -0.585950  0.029123 -1.434855
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315

In [23]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [25]:
df.to_numpy()  #will find the numpy dtype that can hold all dtypes of the dataframe
               #may end up casting all to object
               #does not include index or column labels

array([[-0.44450483,  0.23804446,  0.4043375 , -1.34125449],
       [ 1.07451738, -0.25118262,  1.51052339, -0.10467817],
       [ 0.10555455, -1.13446305,  1.26586287,  2.32354986],
       [-0.18416522, -0.78162403, -0.29642568, -0.92310494],
       [ 0.16176333, -0.58594982,  0.02912312, -1.43485456],
       [-0.49009852, -1.34037183, -1.50691968, -1.68931458]])

In [26]:
df.describe()  #quick summary

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.037178 -0.642591  0.234417 -0.528276
std    0.575378  0.579671  1.102488  1.503267
min   -0.490099 -1.340372 -1.506920 -1.689315
25%   -0.379420 -1.046253 -0.215038 -1.411455
50%   -0.039305 -0.683787  0.216730 -1.132180
75%    0.147711 -0.334874  1.050482 -0.309285
max    1.074517  0.238044  1.510523  2.323550

In [27]:
df.T  #transpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.444505    1.074517    0.105555   -0.184165    0.161763   -0.490099
B    0.238044   -0.251183   -1.134463   -0.781624   -0.585950   -1.340372
C    0.404338    1.510523    1.265863   -0.296426    0.029123   -1.506920
D   -1.341254   -0.104678    2.323550   -0.923105   -1.434855   -1.689315

In [28]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -1.341254  0.404338  0.238044 -0.444505
2013-01-02 -0.104678  1.510523 -0.251183  1.074517
2013-01-03  2.323550  1.265863 -1.134463  0.105555
2013-01-04 -0.923105 -0.296426 -0.781624 -0.184165
2013-01-05 -1.434855  0.029123 -0.585950  0.161763
2013-01-06 -1.689315 -1.506920 -1.340372 -0.490099

In [31]:
df.sort_values(by="C")  #yay, sorting

                   A         B         C         D
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105
2013-01-05  0.161763 -0.585950  0.029123 -1.434855
2013-01-01 -0.444505  0.238044  0.404338 -1.341254
2013-01-03  0.105555 -1.134463  1.265863  2.323550
2013-01-02  1.074517 -0.251183  1.510523 -0.104678

## Selection

In [32]:
df["A"] == df.A

2013-01-01    True
2013-01-02    True
2013-01-03    True
2013-01-04    True
2013-01-05    True
2013-01-06    True
Freq: D, Name: A, dtype: bool

In [33]:
df["A"]

2013-01-01   -0.444505
2013-01-02    1.074517
2013-01-03    0.105555
2013-01-04   -0.184165
2013-01-05    0.161763
2013-01-06   -0.490099
Freq: D, Name: A, dtype: float64

In [34]:
df.A

2013-01-01   -0.444505
2013-01-02    1.074517
2013-01-03    0.105555
2013-01-04   -0.184165
2013-01-05    0.161763
2013-01-06   -0.490099
Freq: D, Name: A, dtype: float64

In [35]:
df[1:4]

                   A         B         C         D
2013-01-02  1.074517 -0.251183  1.510523 -0.104678
2013-01-03  0.105555 -1.134463  1.265863  2.323550
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105

In [36]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01 -0.444505  0.238044  0.404338 -1.341254
2013-01-02  1.074517 -0.251183  1.510523 -0.104678
2013-01-03  0.105555 -1.134463  1.265863  2.323550

In [37]:
df.loc[dates[0]]   #remember dates is the array for the index

A   -0.444505
B    0.238044
C    0.404338
D   -1.341254
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:,["A", "B"]]

                   A         B
2013-01-01 -0.444505  0.238044
2013-01-02  1.074517 -0.251183
2013-01-03  0.105555 -1.134463
2013-01-04 -0.184165 -0.781624
2013-01-05  0.161763 -0.585950
2013-01-06 -0.490099 -1.340372

In [43]:
df.loc['20130102':"2013-01-04", ["B", 'C']]  #probably terrible form to do this, but different styles work
      #both endpoints included

                   B         C
2013-01-02 -0.251183  1.510523
2013-01-03 -1.134463  1.265863
2013-01-04 -0.781624 -0.296426

In [44]:
df.loc["20130102", ["A", "B"]] #dimensions reduced

A    1.074517
B   -0.251183
Name: 2013-01-02 00:00:00, dtype: float64

In [46]:
df.loc[dates[0], 'A'] #just get the value

-0.4445048338790008

In [47]:
df.at[dates[0],'A']  #fast access (why fast?)

-0.4445048338790008

Selection by position

In [48]:
df.iloc[3]

A   -0.184165
B   -0.781624
C   -0.296426
D   -0.923105
Name: 2013-01-04 00:00:00, dtype: float64

In [49]:
df.iloc[3:5, 1:3] #last endpoint excluded

                   B         C
2013-01-04 -0.781624 -0.296426
2013-01-05 -0.585950  0.029123

In [50]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.074517  1.510523
2013-01-03  0.105555  1.265863
2013-01-05  0.161763  0.029123

In [51]:
df.iloc[3:5, :] #rows

                   A         B         C         D
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105
2013-01-05  0.161763 -0.585950  0.029123 -1.434855

In [52]:
df.iloc[:, 1:3] #columns

                   B         C
2013-01-01  0.238044  0.404338
2013-01-02 -0.251183  1.510523
2013-01-03 -1.134463  1.265863
2013-01-04 -0.781624 -0.296426
2013-01-05 -0.585950  0.029123
2013-01-06 -1.340372 -1.506920

In [58]:
%%time
df.iloc[4,2]

Wall time: 0 ns

0.02912311600152645

In [57]:
%%time
df.iat[4,2] #fast access  (why fast??)

Wall time: 0 ns

0.02912311600152645

## Boolean Indexing

In [59]:
df[df["A"]>0]  #just those rows

                   A         B         C         D
2013-01-02  1.074517 -0.251183  1.510523 -0.104678
2013-01-03  0.105555 -1.134463  1.265863  2.323550
2013-01-05  0.161763 -0.585950  0.029123 -1.434855

In [60]:
df[df>0]  #just those values

                   A         B         C        D
2013-01-01       NaN  0.238044  0.404338      NaN
2013-01-02  1.074517       NaN  1.510523      NaN
2013-01-03  0.105555       NaN  1.265863  2.32355
2013-01-04       NaN       NaN       NaN      NaN
2013-01-05  0.161763       NaN  0.029123      NaN
2013-01-06       NaN       NaN       NaN      NaN

In [61]:
df1 = df.copy()
df1["E"] = ['one','one','two','two','three','four']
df1

                   A         B         C         D      E
2013-01-01 -0.444505  0.238044  0.404338 -1.341254    one
2013-01-02  1.074517 -0.251183  1.510523 -0.104678    one
2013-01-03  0.105555 -1.134463  1.265863  2.323550    two
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105    two
2013-01-05  0.161763 -0.585950  0.029123 -1.434855  three
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315   four

In [62]:
df1[df1['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.105555 -1.134463  1.265863  2.323550   two
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105   two
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315  four

## Setting

In [67]:
s1 = pd.Series([1,2,3,4,5,6],index = pd.date_range('20130101',periods = 6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [71]:
df['F'] = s1
df

                   A         B         C         D  F
2013-01-01  0.000000  0.000000  0.404338 -1.341254  1
2013-01-02  1.074517 -0.251183  1.510523 -0.104678  2
2013-01-03  0.105555 -1.134463  1.265863  2.323550  3
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105  4
2013-01-05  0.161763 -0.585950  0.029123 -1.434855  5
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315  6

In [72]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D  F
2013-01-01  0.000000  0.000000  0.404338 -1.341254  1
2013-01-02  1.074517 -0.251183  1.510523 -0.104678  2
2013-01-03  0.105555 -1.134463  1.265863  2.323550  3
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105  4
2013-01-05  0.161763 -0.585950  0.029123 -1.434855  5
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315  6

In [73]:
df.iat[0,1]= 0
df

                   A         B         C         D  F
2013-01-01  0.000000  0.000000  0.404338 -1.341254  1
2013-01-02  1.074517 -0.251183  1.510523 -0.104678  2
2013-01-03  0.105555 -1.134463  1.265863  2.323550  3
2013-01-04 -0.184165 -0.781624 -0.296426 -0.923105  4
2013-01-05  0.161763 -0.585950  0.029123 -1.434855  5
2013-01-06 -0.490099 -1.340372 -1.506920 -1.689315  6

In [74]:
df.loc[:,"D"] = np.array([5]*len(df))
df

                   A         B         C  D  F
2013-01-01  0.000000  0.000000  0.404338  5  1
2013-01-02  1.074517 -0.251183  1.510523  5  2
2013-01-03  0.105555 -1.134463  1.265863  5  3
2013-01-04 -0.184165 -0.781624 -0.296426  5  4
2013-01-05  0.161763 -0.585950  0.029123  5  5
2013-01-06 -0.490099 -1.340372 -1.506920  5  6

In [75]:
df1 = df.copy()
df1[df1 < 0] = -df1
df1

                   A         B         C  D  F
2013-01-01  0.000000  0.000000  0.404338  5  1
2013-01-02  1.074517  0.251183  1.510523  5  2
2013-01-03  0.105555  1.134463  1.265863  5  3
2013-01-04  0.184165  0.781624  0.296426  5  4
2013-01-05  0.161763  0.585950  0.029123  5  5
2013-01-06  0.490099  1.340372  1.506920  5  6

## Missing data

np.nan values are not included in computations by default

In [76]:
df

                   A         B         C  D  F
2013-01-01  0.000000  0.000000  0.404338  5  1
2013-01-02  1.074517 -0.251183  1.510523  5  2
2013-01-03  0.105555 -1.134463  1.265863  5  3
2013-01-04 -0.184165 -0.781624 -0.296426  5  4
2013-01-05  0.161763 -0.585950  0.029123  5  5
2013-01-06 -0.490099 -1.340372 -1.506920  5  6

In [78]:
df1 = df.reindex(index=dates[0:4], columns = list(df.columns) + ["E"])
df1.loc[dates[0]: dates[1], "E"] = 1
df1

                   A         B         C  D  F    E
2013-01-01  0.000000  0.000000  0.404338  5  1  1.0
2013-01-02  1.074517 -0.251183  1.510523  5  2  1.0
2013-01-03  0.105555 -1.134463  1.265863  5  3  NaN
2013-01-04 -0.184165 -0.781624 -0.296426  5  4  NaN